import csv
import torch
from transformers import AutoTokenizer, AutoModelForCausalLM
from peft import PeftModel, PeftConfig

# LoRA微调模型路径
finetune_model_path = 'model_WM/'

# 加载LoRA配置
config = PeftConfig.from_pretrained(finetune_model_path)

# 加载分词器
tokenizer = AutoTokenizer.from_pretrained(config.base_model_name_or_path, use_fast=False)
tokenizer.pad_token = tokenizer.eos_token

# 确定设备
device_map = "cuda:1" if torch.cuda.is_available() else "cpu"  # 修改为cpu或指定其他可用的cuda设备

# 加载基础模型并应用LoRA微调
model = AutoModelForCausalLM.from_pretrained(
    config.base_model_name_or_path,
    device_map=device_map,
    torch_dtype=torch.float16 if torch.cuda.is_available() else torch.float32,  # 确保在CPU上使用float32
    load_in_8bit=torch.cuda.is_available(),  # 仅在CUDA上启用8位加载
    trust_remote_code=True,
    use_flash_attention_2=torch.cuda.is_available()  # 仅在CUDA上启用flash attention
)
model = PeftModel.from_pretrained(model, finetune_model_path, device_map={"": 0})
model = model.eval()

# 疾病名称列表
diseases = {"伤寒", "温病", "时行感冒", "烂喉痧", "温疫", "痄腮", "腮腺炎", "痧", "急性胃肠炎", "痢疾", "白喉", "疟疾",
            "流行性乙型脑炎", "流行性出血热", "虚劳", "咳嗽", "哮证", "喘证", "肺炎", "肺痈", "肺脓肿", "肺痨",
            "肺结核", "肺胀", "肺气肿", "呕吐", "反胃", "噎膈", "呃逆", "胃痛", "泄泻", "便秘", "黄疸", "狐惑",
            "贝赫切特氏综合征", "水肿", "消渴", "积聚", "血证", "紫斑", "痹证", "痿证", "肠道寄生虫病", "鼓胀",
            "肝硬化", "淋证", "癃闭", "关格", "尿毒症", "头痛", "胸痛", "胁痛", "真心痛", "腹痛", "腰痛", "遗尿",
            "遗精", "阳痿", "早泄", "男性不育", "眩晕", "肥胖病", "面瘫", "胸痹", "心悸", "健忘", "失眠", "多寐",
            "癫证", "狂", "痫", "中风", "郁证", "震颤", "内伤发热", "痞满", "厌食", "中暑", "汗证", "冠心病",
            "心律失常", "高血压", "高脂血症", "糖尿病", "病毒性肝炎", "胆囊炎", "胆结石", "泌尿系结石", "慢性肾炎",
            "胃下垂", "老年性痴呆症", "鼻咽癌", "甲状腺癌", "肺癌", "食管癌", "胃癌", "大肠癌", "肝癌", "白血病",
            "硬皮病", "红斑狼疮", "月经不调（痛经, 经闭, 倒经, 崩漏, 功能性子宫出血）", "带下", "恶阻", "妊娠呕吐",
            "胎动不安", "胎漏", "滑胎", "习惯性流产", "产后腹痛", "宫外孕", "子宫肌瘤", "子宫脱垂", "子宫颈炎",
            "宫颈糜烂", "子宫颈癌", "盆腔炎", "阴痒", "阴道炎", "女子不孕", "乳腺癌", "更年期综合征", "小儿感冒",
            "小儿肺炎", "惊风", "百日咳", "水痘", "麻疹", "风疹", "消化不良", "盘肠气痛", "幼儿腹痛", "小儿肌性斜颈",
            "小儿脑性瘫痪", "夜啼", "小儿流涎", "佝偻病", "痈", "疽", "疖", "疔疮", "瘰疬", "淋巴结结核", "瘿",
            "地方性甲状腺肿", "甲状腺肿瘤", "乳痈", "乳腺炎", "乳癖", "乳腺增生", "脱疽", "血栓闭塞性脉管炎", "臁疮",
            "痔", "疝", "肛裂", "肛门瘙痒症", "肛门周围痈疽", "肛门直肠周围脓肿", "肠痈", "急性阑尾炎", "肠梗阻",
            "胆道系统感染和胆石病", "脓疱疮", "黄水疮", "湿疮", "湿疹", "圆癣", "体癣", "股癣", "白秃疮", "肥疮",
            "头癣", "蛇串疮", "带状疱疹", "鹅掌风", "牛皮癣", "神经性皮炎", "梅毒", "漆疮", "接触性皮炎", "瘾疹",
            "荨麻疹", "白癜风", "白疕", "银屑病", "白屑风", "脂溢性皮炎", "丹毒", "扁平疣", "粉刺", "雀斑", "黄褐斑",
            "皮肤瘙痒", "瘢痕疙瘩", "毒蛇咬伤", "痱子", "酒皶鼻", "骨折", "筋伤", "软组织损伤", "伤科内伤", "关节脱位",
            "腰腿痛（腰肌劳损, 腰椎间盘脱出症, 坐骨神经痛）", "颈臂痛（颈椎病, 肩关节周围炎）", "退行性骨关节炎",
            "骨质增生", "失音", "慢性咽炎", "乳蛾", "急性扁桃体炎", "梅核气", "鼻渊", "鼻窦炎", "鼻窒", "慢性鼻炎",
            "鼻鼽", "过敏性鼻炎", "耳鸣耳聋", "聤耳", "化脓性中耳炎", "牙痛", "牙痈", "牙宣", "萎缩性牙周病", "口疮",
            "针眼", "天行赤眼", "红眼病", "眼丹", "翳", "白内障", "上睑下垂", "雀盲", "夜盲", "青盲", "青光眼",
            "漏睛疮", "泪囊炎", "近视", "咳嗽", "喘证", "肺痈", "肺痨", "肺胀", "肺痿", "暴喘", "咯血", "鼻衄", "失音",
            "肺衰", "哮病", "心悸", "胸痹", "真心痛", "不寐病", "多寐病", "健忘病", "癫狂", "痫病", "痴呆", "厥证",
            "惊悸", "怔忡病", "卒心痛", "心衰病", "昏迷病", "神昏病", "抽搐病", "卒死病", "胃痛", "吐酸", "嘈杂",
            "痞满", "呕吐", "噎膈", "反胃", "呃逆", "腹痛", "泄泻", "痢疾", "霍乱", "疫毒痢", "便秘", "暴吐", "腹胀满",
            "暴泻", "吐血", "便血", "齿衄", "紫癜", "胁痛", "黄疸", "阴黄", "阳黄", "急黄", "萎黄", "积聚", "鼓胀",
            "头痛", "眩晕", "中风", "瘿病", "疟疾", "胆胀", "水臌", "气臌", "血臌", "虫臌", "头风", "热厥", "水肿",
            "淋证", "癃闭", "关格", "阳痿", "遗精", "梦遗", "滑精", "旱泄", "阳水", "阴水", "热淋", "石淋", "气淋",
            "血淋", "膏淋", "劳淋", "尿浊", "尿血", "遗尿", "肾衰", "郁证", "血证", "痰饮", "悬饮", "溢饮", "支饮",
            "消渴", "自汗", "盗汗", "内伤发热", "虚劳", "肥胖", "痹证", "痉证", "痿症（痿病）", "颤证", "腰痛", "感冒",
            "外感高热", "风温病", "风温肺热病", "春温", "暑温", "冒暑", "暑秽", "中暑", "湿温", "湿阻", "伏暑", "秋燥",
            "温燥", "凉燥", "大头瘟", "烂喉痧", "太阳病", "少阳病", "阳明病", "太阴病", "少阴病", "厥阴病", "蛔虫病",
            "绦虫病", "钩虫病", "蛲虫病", "姜片虫病", "血吸虫病", "丝虫病", "囊虫病", "疖", "疔", "痈", "发", "有头疽",
            "无头疽", "流注", "发颐", "丹毒", "走黄", "内陷", "流痰", "瘰疬", "褥疮", "窦道", "暑疖", "石疖", "软疖",
            "蝼蛄疖", "颜面疔疮", "手足疔疮", "蛇眼疔", "蛇头疔", "蛇腹疔", "托盘疔", "足底疔", "红丝疔", "烂疔",
            "疫疔", "肘痈", "脐痈", "腘窝痈", "锁喉痈", "臀痈", "腓发病", "手发背", "足发背", "脑疽", "背疽", "膻中疽",
            "少腹疽", "附骨疽", "环跳疽", "青蛇毒", "痰毒", "颈痈", "腋痈", "胯腹痈", "乳痈", "乳发", "乳痨", "乳漏",
            "乳癖", "乳疬", "乳核", "乳衄", "乳疽", "乳头风", "气瘿", "肉瘿", "瘿痈", "石瘿", "气瘤", "血瘤", "筋瘤",
            "耳鸣耳聋", "肛痈", "呕吐", "月经后期", "脓耳口眼喁斜", "暴聋", "痔", "精浊", "脓耳", "紫癜风", "小儿哮喘",
            "耳根毒", "里喉痈", "经行情志异常", "喉关痈", "小儿疫毒痢", "红蝴蝶疮", "天行赤眼暴翳", "阴挺", "风轮赤豆",
            "恶露不绝", "鼻窒", "扁瘊", "时复症", "热烫伤目", "儿童多动症", "软脚瘟", "旋耳疮", "精癃", "冷泪病",
            "小儿血吸虫病", "经断复来", "经行风疹块", "视瞻昏渺", "土风疮", "黄液上冲", "小儿咳嗽", "真睛破损",
            "酒齄鼻", "产后小便不通", "小儿囊虫病", "喉风", "绝经前后诸病", "耳疖", "经行发热", "猫眼疮", "湿疮",
            "辘轳转关", "子满", "凝脂翳", "鼻疳", "黧黑斑", "脱疽", "产后乳汁自出", "脱囊", "风痧", "异物入耳",
            "赤膜下垂", "肥疮", "经期延长", "赤脉传睛", "天疱疮", "癥瘕", "喉癣", "厌食", "奶麻", "脐湿", "耳壳流痰",
            "肾岩", "痛经", "耳眩晕", "脱肛", "鼠乳", "鼻损伤", "混睛障", "积滞", "产后血崩", "喉痹", "热疮",
            "经间期出血", "猩红热", "神水将枯", "滑胎", "黄耳伤寒", "白喉", "鹅掌风", "瓜藤缠", "鸡眼", "胬肉攀睛",
            "小儿尿频", "肛漏", "青盲", "崩漏", "产后腹痛", "天行赤眼", "目痒病", "骨鲠", "毒虫咬伤", "皮痹", "肉瘤",
            "上颚痈", "登豆疮", "男性不育症", "老花眼", "小产", "生殖器疱疹", "黄水疮", "子烦", "伤风鼻塞", "小儿水肿",
            "小儿绦虫病", "白睛溢血", "白膜侵睛", "赤游丹", "百日咳", "四弯风", "聋哑症", "蝎螫伤", "阴吹", "胞衣不下",
            "茧唇", "粉刺", "五软", "鼻渊", "惊风", "异物眯目", "月经先期", "面游风", "鼻疔", "蛇串疮", "汗证", "癫痫",
            "子悬", "经行眩晕", "鬼胎", "脂瘤", "暴盲", "喉痈", "佝偻病", "痄腮", "漏睛疮", "肺炎喘嗽", "水痘", "瘾疹",
            "奶癣", "狐疝", "振胞瘀痛", "花翳白陷", "风瘙痒", "妊娠恶阻", "高风内障", "紫癜", "鹅口疮", "月经过多",
            "龋齿", "胞睑病暴风客热", "不孕", "鼻槁", "口疮", "产后身痛", "冻疮", "酸碱伤目", "臁疮", "耳廓痰包",
            "脚湿气", "幼儿急疹", "蜂螫伤", "妇人腹痛", "飞扬喉", "脓耳变症", "阴茎痰核", "白涩", "鼻息肉", "夏季热",
            "乳岩", "小儿姜片虫病", "五硬", "顽湿聚结", "泄泻", "唇风", "舌菌", "锁肛痔", "牙痈", "缺乳", "撞击伤目",
            "脐突", "耳瘘", "产后痉病", "产后发热", "云雾移睛", "血翳包睛", "白驳风", "遗尿", "肛隐窝炎",
            "经行乳房胀痛", "经行浮肿", "白秃疮", "胎动不安", "鼻鼽", "流皮漏", "颌下痈", "眉棱骨痛", "紫白癜风",
            "牙痛", "胎萎不长", "胎死不下", "圆翳内障", "闭经", "火疳", "远视", "淋病", "小儿痿病", "胎漏", "油风",
            "阴痒", "夜啼", "血精", "疣", "蟹睛", "经行口糜", "脏躁", "鼻衄", "耵耳", "子痰", "麻疹", "灰指（趾）甲",
            "突起睛高", "息肉痔", "囊痈", "异物梗喉", "电光伤目", "乳蛾", "金疳", "脓窝疮", "产后血晕", "经行泄泻",
            "疳证", "耳闭", "漏睛", "顿咳", "癣", "肛裂", "骨槽风", "恶露不下", "麻风", "水火烫伤", "毒蛇咬伤",
            "热入血室", "胎患内障", "鼻腔异物", "小儿蛔虫病", "蟹足肿", "经行身痛", "耳痔", "失荣", "肾囊风", "腹痛",
            "聚星障", "产后遗粪", "产后小便频数", "青风内障", "悬珠痔", "产后交肠病", "牛皮癣", "阴疮", "风热疮",
            "非淋菌性尿道炎", "口糜", "破伤风", "孕痈", "脐风", "耳疮", "转胞", "瞳神紧小", "近视", "耳胀", "食积",
            "喉喑", "狗咬伤", "尖锐湿疣", "狐惑病", "惊震内障", "病毒性心肌炎", "股肿", "绿风内障", "梅毒", "鹘眼凝睛",
            "小儿丝虫病", "久聋", "牙宣", "疣目", "药毒", "肛门湿疡", "宿翳", "疝气", "子痫", "经行吐衄", "疥疮",
            "小儿钩虫病", "月经过少", "瞳神干缺", "子淋", "骨瘤", "水疝", "月经先后无定期", "婴儿湿疮", "子晕", "胎黄",
            "胼胝", "梅核气", "小儿蛲虫病", "子痈", "产后大便难", "尿石症", "白睛青蓝", "接触性皮炎", "子嗽", "难产",
            "产后汗症", "五迟", "蜈蚣螫伤", "丹痧", "虫咬皮炎", "经行头痛", "血灌瞳神", "断耳疮", "脐疮", "手足口病",
            "妊娠腹痛", "产后遗尿", "胎怯", "火赤疮", "性早熟", "硬肿症", "小儿感冒", "圆癣", "视直如曲", "子肿",
            "脐血", "风牵偏视", "疳积上目", "产后尿血", "麻疹", "婴幼儿急疹", "水痘", "小儿麻痹症(脊髓灰质炎)",
            "猩红热", "百日咳", "肥胖症", "鞘膜积液", "隐睾", "包茎和包皮过长", "小儿疳积", "蚕豆病", "川崎病",
            "性早熟", "遗尿症", "夜惊", "惊厥", "异食癖", "夜啼", "小舞蹈病", "儿童多动症", "婴幼儿先天性心脏病",
            "强迫症", "小儿胆道蛔虫症", "儿童脑性瘫痪", "低血糖症", "尿崩症", "先天性处女膜闭锁", "小儿头颈歪斜",
            "小儿斜视", "弱视", "鸡胸和漏斗胸", "语言发育迟缓", "遗传代谢病", "原发性免疫缺陷病", "抽动-秽语综合征",
            "先天性马蹄内翻足", "先天性无阴道", "阴道横膈", "阴道纵膈", "外阴瘙痒", "前庭大腺炎", "滴虫性阴道炎",
            "念珠菌阴道炎", "霉菌性阴道炎", "老年性阴道炎", "外阴营养不良改变", "子宫发育异常", "子宫脱垂", "子宫颈炎",
            "女性生殖器官结核", "盆腔炎", "盆腔瘀血综合征", "闭经泌乳综合征", "尿瘘", "粪瘘", "女性不孕症", "月经不调",
            "经前期紧张综合征", "经行头痛", "月经疹", "倒经", "痛经", "闭经", "功能性子宫出血", "子宫内膜异位症",
            "席汉压征", "多囊卵巢综合征", "更年期综合征", "妊娠剧吐", "流产", "早产", "妊娠高血压综合征",
            "妊娠合并心脏病", "妊娠合并慢性肾炎", "妊娠合并糖尿病", "妊娠合并甲亢", "妊娠合并病毒性肝炎",
            "妊娠合并贫血", "妊娠合并急性阑尾炎", "异位妊娠", "多胎妊娠", "高危妊娠", "过期妊娠", "葡萄胎",
            "侵蚀性葡萄胎", "绒毛膜癌", "前置胎盘", "胎盘早期剥离", "羊水过多", "羊水过少", "产力异常", "骨产道异常",
            "软产道异常", "胎位异常", "胎儿宫内发育迟缓", "胎儿畸形", "胎儿宫内窘迫", "羊水栓塞", "子宫破裂",
            "胎盘滞留、残留及植入", "脐带脱垂", "产后出血", "晚期产后出血", "产后腹痛", "产后腰痛", "产后缺乳",
            "产后乳汁外溢", "产后便秘", "产后恶露不绝", "产后回乳", "产后乳头破裂", "产后尿潴留", "产后尿失禁",
            "产褥中暑", "产后尿瘘", "子宫内膜炎", "产后发热", "产前出血", "产褥感染", "产后子宫复旧不全", "睑缘炎",
            "睑内翻", "睑外翻", "眼睑闭合不全", "上睑下垂", "倒睫", "睑板腺囊肿", "睑腺炎", "飞蚊症", "慢性泪囊炎",
            "急性泪囊炎", "沙眼", "急性结膜炎", "翼状胬肉", "泡性结角膜炎", "春季结膜炎", "角膜软化症",
            "流行性角膜结膜炎", "细菌性角膜炎", "病毒性角膜炎", "角膜基质炎", "夜盲症", "化脓性角膜溃疡",
            "原发性急性闭角型青光眼", "原发性慢性闭角型青光眼", "原发性开角型青光眼", "继发性青光眼", "先天性青光眼",
            "巩膜炎", "表层巩膜炎", "虹膜睫状体炎", "先天性白内障", "外伤性白内障", "并发性白内障", "视神经炎",
            "视神经萎缩", "视乳头水肿", "视网膜脱离", "视网膜中央静脉阻塞", "视网膜静脉周围炎", "视网膜中央动脉阻塞",
            "视网膜色素变性", "中心性浆液性脉络膜视网膜炎", "糖尿病性视网膜病变", "远视眼", "近视眼", "散光眼",
            "共同性斜视", "麻痹性斜视", "眼挫伤", "角结膜异物", "眼球穿通伤", "眼内异物", "交感性眼炎", "化学烧伤",
            "电光性眼炎", "黄斑变性", "眼底病变", "黄斑裂孔", "眼底出血", "玻璃体浑浊", "外耳道炎", "外耳道疖",
            "外耳湿疹", "急性化脓性中耳炎", "慢性化脓性中耳炎", "急性非化脓性中耳炎", "慢性非化脓性中耳炎",
            "美尼尔氏病", "噪音性耳聋", "突发性耳聋", "药物中毒性耳聋", "内耳炎(迷路炎)", "外耳道耵聍栓塞",
            "外耳道异物", "聋哑", "鼻疖", "鼻前庭炎", "急性鼻炎", "慢性鼻炎", "萎缩性鼻炎", "过敏性鼻炎", "鼻窦炎",
            "鼻出血", "鼻息肉", "常见的鼻部良性肿瘤", "急性咽炎", "慢性咽炎", "急性扁桃体炎", "慢性扁桃体炎",
            "急性会厌炎", "腺样体肥大", "咽后脓肿", "鼻咽癌", "扁桃体周围脓肿", "急性喉炎", "慢性喉炎", "小儿急性喉炎",
            "白色念株菌病", "喉外伤", "复发性口腔溃疡", "牙髓病", "龋病", "牙周炎", "流涎症", "慢性牙龈炎", "慢性唇炎",
            "肉芽肿性唇炎", "腺性唇炎", "口角炎", "根尖周炎", "复发性阿弗它性溃疡", "地图舌", "黑毛舌", "智齿冠周炎",
            "颌血部间隙感染", "颜面部疖痈", "颌骨骨髓炎", "下颌骨骨折", "颞下颌关节紊乱综合征", "颞下颌关节强直",
            "错殆畸形", "牙折", "楔状缺损", "口腔粘膜扁平苔藓", "牙齿感觉过敏症", "磨牙症", "坏疽性龈口炎", "创伤",
            "水、火、烫伤", "中暑", "冻伤", "毒蛇咬伤", "狗咬伤", "蜂类螫伤", "蜈蚣咬伤", "猫鼠咬伤", "蝎和毒蜘蛛咬伤",
            "外耳道异物", "角膜结膜异物", "呼吸道异物", "晕动症", "急性感染伤口的处理", "过敏反应", "煤气中毒",
            "沥青中毒", "安眠药中毒", "有机磷杀虫药中毒", "硫化氢中毒", "灭鼠剂中毒", "急性酒精中毒", "发芽马铃薯中毒",
            "棉子中毒", "毒蕈中毒", "食物中毒", "溺水", "电击伤", "骨折", "内出血", "勒缢", "菜窖窒息", "休克",
            "心跳骤停", "晕厥", "眩晕", "突然分娩", "小腿突然抽筋", "掉下巴", "鼻出血", "呃逆", "化学物损伤", "晒伤",
            "伤风", "流行性感冒", "流行性腮腺炎", "病毒性肝炎", "伤寒、副伤寒", "霍乱", "肺结核病", "细菌性痢疾", "天花",
            "流行性脑脊髓膜炎", "白喉", "流行性乙型脑炎", "疟疾", "流行性出血热", "狂犬病", "鼠疫", "炭疽", "败血症",
            "布氏杆菌病", "森林脑炎", "登革热", "回归热", "鼠咬热", "流行性斑疹伤寒", "鼠型斑疹伤寒", "恙虫病",
            "阿米巴痢疾", "阿米巴肝脓肿", "黑热病", "弓形体病", "血吸虫病", "肺吸虫病", "华支睾吸虫病", "姜片虫病",
            "丝虫病", "钩虫病", "蛔虫病", "蛲虫病", "旋毛虫病", "绦虫病与囊虫病", "包虫病", "梨形鞭毛虫病",
            "肺炎球菌肺炎", "萄球菌肺炎", "厌氧菌肺炎", "军团菌肺炎", "五革兰阴性杆菌肺炎", "克雷白杆菌肺炎",
            "病毒性肺炎", "吸入性肺炎", "放射性肺炎", "肺脓肿", "肺气肿", "急性气管支气管炎", "慢性支气管炎",
            "支气管哮喘", "气管扩张症", "自发性气胸", "纵隔气肿", "呼吸衰竭", "睡眠性呼吸停顿综合征",
            "慢性肺源性心脏病", "肺栓塞", "先天性肺动静脉瘘", "胸膜炎", "肥胖通气不良综合征", "结节病", "韦格纳肉芽肿",
            "肺出血-肾炎综合征", "心力衰竭", "心律失常", "感染性心内膜炎", "冠状动脉粥样硬化性心脏病", "高血压",
            "心肌病", "心肌炎", "克山病", "心包炎", "梅毒性心血管病", "心脏神经官能症", "风湿性心脏病",
            "风湿性心脏瓣膜病", "反流性食管炎", "急性胃炎", "慢性胃炎", "胃粘膜脱垂症", "消化性溃疡", "肠结核",
            "结核性腹膜炎", "克隆氏病", "慢性结肠炎", "消化道憩室", "胃肠神经官能症", "肝硬化", "肝性昏迷", "脂肪肝",
            "急性胰腺炎", "慢性胰腺炎", "胃下垂", "消化道出血", "急性胃扩张", "胃结石", "非溃疡消化不良",
            "阿米巴肝脓肿", "细菌性肝脓肿", "肝肾综合症", "酒精性肝病", "自身免疫性慢性肝炎", "肝囊肿", "胆囊炎",
            "急性化脓性胆管炎", "原发性硬化性胆管炎", "便秘", "腹泻", "慢性胃溃疡", "垂体性侏儒症",
            "垂体前叶功能减退症", "尿崩症", "原发性慢性肾上腺皮质机能减退症", "原发性醛固酮增多症", "皮质醇增多症",
            "单纯性甲状腺肿", "甲状腺功能亢进症", "甲状腺功能减退症", "甲状旁腺功能亢进症", "甲状旁腺功能减退症",
            "糖尿病", "低血糖症", "高脂血症", "酸碱平衡紊乱", "肥胖病", "营养不良性消瘦", "维生素B1缺乏症(脚气病)",
            "核黄素缺乏病", "烟酸缺乏病", "坏血病", "维生素K缺乏症", "尿毒症", "痛风", "肾功能衰竭", "急性肾小球肾炎",
            "急进性肾小球肾炎", "肾小球肾炎", "肾病综合征", "肾结石", "肾结核", "多囊肾", "肾盂肾炎", "缺铁性贫血",
            "铁粒幼细胞性贫血", "巨幼细胞贫血", "再生障碍性贫血", "溶血性贫血", "类白血病反应", "骨髓增生异常综合征",
            "白细胞减少症和粒细胞缺乏症", "血友病", "嗜酸粒细胞增多症", "血管性血友病", "原发性纤维蛋白溶解症",
            "风湿热", "进行性系统性硬皮病", "多发性肌炎", "干燥综合征", "脂膜炎", "疖", "痈", "丹毒",
            "急性淋巴管炎、淋巴结炎", "脓肿", "急性蜂窝织炎", "脓性指头炎", "甲沟炎", "手指急性化脓性腱鞘炎",
            "手掌深部间隙感染", "破伤风", "气性坏疽", "胆囊炎", "胆石症", "胆道蛔虫症", "落枕", "头皮损伤", "颅骨骨折",
            "脑震荡", "颅内高压", "脑疝", "脑寄生虫病", "霉菌性肉芽肿", "颅内蛛网膜囊肿", "脑动静脉畸形",
            "颈内动脉海绵窦瘘", "高血压性脑出血", "闭塞性缺血性脑血管病", "颅底凹入症", "颅裂与脊椎裂", "狭颅症",
            "脑积水", "脑脓肿", "硬脊膜外脓肿", "颈淋巴结结核", "颈部肿块", "老年性痴呆", "颅内肿瘤", "胃癌",
            "神经衰弱", "多发性硬化症", "唇癌", "亚急性联合变性", "血管瘤", "脑肿瘤", "化脓性腮腺炎", "遗传性共济失调",
            "脊髓空洞症", "震颤麻痹", "皮肤隆突性纤维肉瘤", "多发性神经炎", "乳腺纤维瘤", "脑栓塞", "鼻咽癌",
            "干燥综合征", "肝腹水", "颌面部放线菌病", "坐骨神经痛", "短暂脑缺血发作", "外阴癌", "牙龈癌",
            "运动神经元病", "周期性精神病", "老年人低血压", "抑郁症", "踝关节骨性关节病", "呃逆", "原发性纵隔肿瘤",
            "职业性重听", "恶性黑色素瘤", "颈椎病", "老年人痔疮", "更年期抑郁症", "胆囊癌", "脊椎骨性关节病",
            "蛛网膜下腔出血", "贲门癌", "男性乳癌", "偏头痛", "面肌痉挛", "神经官能症", "细菌性痢疾",
            "膝关节骨性关节病", "口腔粘膜扁平苔癣", "动脉瘤", "周围面神经炎", "排尿性晕厥", "睾丸肿瘤", "根尖周病",
            "脑出血", "膀胱癌", "子宫肌瘤", "肺癌", "甲状腺功能减退症", "白血病", "面神经炎", "冠周炎", "失眠",
            "前列腺癌", "精神分裂症", "皮肤癌", "骨肿瘤", "口腔粘膜白角化病与白斑病", "大肠癌",
            "急性感染性多发性神经根炎", "涎腺混合瘤", "间质性肺疾病", "偏执性精神病", "老年性白内障", "肠道易激综合征",
            "卵巢癌", "重症肌无力", "喉癌", "甲状腺癌", "肝癌", "乳癌", "情感性精神障碍", "强迫性神经症", "脊髓压迫症",
            "软组织肿瘤", "牙痛", "食管癌", "子宫体癌", "骨质疏松", "胰腺癌", "脑膜炎", "症状性精神病",
            "退行性瓣膜性心脏病", "慢性苯中毒", "躁狂抑郁症", "三叉神经痛", "阑尾肿瘤", "脑动脉硬化症", "老花眼",
            "淋巴瘤", "流行性腮腺炎", "肝豆状核变性", "铸造热", "脑血栓", "恐怖性神经症", "宫颈癌", "肝硬化", "肾癌",
            "髋关节骨性关节病", "脊髓肿瘤", "进行性肌营养不良", "冠心病", "甲状腺肿瘤", "慢性阻塞性肺病",
            "反应性精神病", "颌面部淋巴结炎", "舌癌", "更年期综合征", "癔症", "眼睑肿瘤", "颧骨骨折",
            "酒中毒所致精神障碍", "焦虑症", "病毒性脑炎", "癫痫", "周期性麻痹", "阴茎癌", "臂丛神经痛", "面瘫",
            "舌咽神经痛", "痤疮", "慢性脓胸", "肘关节脱位", "脓尿", "预激综合征", "肾绞痛", "婴幼儿营养不良",
            "结肠慢通过性便秘", "多乳头和多乳房症(副乳）", "皮肤瘙痒症", "急性腹膜炎", "新生儿颅内出血", "乳房结核",
            "念珠菌病", "鞘膜积液", "手癣和足癣", "急性肾炎", "腰椎间盘突出症", "维生素A缺乏症", "脂溢性皮炎",
            "新生儿坏死性小肠结肠炎", "膀胱炎", "白癜风", "水痘", "类风湿关节炎", "颈椎病", "冻疮", "扁平苔藓", "斑秃",
            "新生儿破伤风", "非淋菌性尿道炎", "着色真菌病", "日光性皮炎", "肩关节周围炎", "腹股沟斜疝", "肱骨髁上骨折",
            "骨质疏松", "汗管角化症", "动脉导管未闭", "肺放线菌病", "乳腺增生病", "肛裂", "血栓闭塞性脉管炎", "肛瘘",
            "急性上呼吸道感染", "遗传过敏性皮炎", "神经性皮炎", "孢子丝菌病", "荨麻疹", "多形性红斑", "新生儿巨结肠",
            "风湿类风湿", "臭汗症", "新生儿皮下坏疽", "须疮", "皮肤结核", "胸壁结核", "新生儿呕吐", "婴幼儿克汀病",
            "急慢性附睾炎", "丘疹性荨麻疹", "骨关节炎", "动静脉瘘", "维生素A缺乏病", "白塞氏综合征", "色素痣", "花斑癣",
            "硬皮病", "髋关节脱位", "巨乳症(女性乳房肥大症）", "带状疱疹", "暑热症", "平足症", "纵隔障炎",
            "化脓性骨髓炎", "毛囊炎", "新生儿假性月经及分泌乳汁", "核黄素缺乏病", "血小板减少性紫癜", "副银屑病",
            "化妆品皮炎", "小儿腹泻", "网球肘", "维生素A中毒", "职业性皮肤病", "疱疹样皮炎", "直肠和肛管伤",
            "肘管综合征", "皮肤淀粉样变性", "排尿困难与尿潴留", "油彩皮炎", "侏儒症", "直肠脱垂", "锁骨骨折",
            "踝部骨折", "汗疱疹", "白发", "擦烂红斑", "腕管综合症", "心房间隔缺损", "掌跖角化病", "先天性髋脱位",
            "气胸", "鸡眼与胼胝", "先天性肥厚性幽门狭窄", "毛囊角化病", "断肢(指再植）", "桡骨小头半脱位", "过敏性紫癜",
            "小腿溃疡", "多毛症", "腱鞘炎", "肾性高血压", "化脓性关节炎", "盘状红斑狼疮", "头癣", "病理性黄疸",
            "股骨头坏死", "主动脉缩窄", "皮肌炎", "肠梗阻", "增殖性脓皮病", "体癣和股癣", "多汗症", "脓胞疮",
            "挤牛奶者结节", "淋病", "精囊炎", "新生儿出血症", "甲癣", "主动脉窦瘤破裂", "皮肤粘膜淋巴结综合征",
            "巨细胞包涵体病", "肋骨骨折", "湿疹", "血胸", "膀胱损伤", "隐翅虫皮炎", "艾滋病", "异位性皮炎",
            "多指(趾畸形）", "急慢性前列腺炎", "骨与关节结核", "化脓性汗腺炎", "单纯糠疹", "新生儿溶血病",
            "肛门直肠周围脓肿", "坏疽性脓皮病", "新生儿败血症", "腱鞘囊肿", "尿失禁", "瑞尔氏黑变病", "肠瘘",
            "婴幼儿便秘", "肾脏损伤", "手中皲裂", "颜面播散性粟粒性狼疮", "新生儿脓疱疹", "呼吸窘迫综合征",
            "系统红斑狼疮", "维生素D缺乏性佝偻病", "泌尿系统结石症", "小儿腹痛", "急慢性阑尾炎", "多囊肾", "丹毒",
            "股骨干骨折", "结节性红斑", "泌尿系结核", "硬红斑", "稻田皮炎", "新生儿流行性腹泻", "疣", "婴幼儿肠套叠",
            "小儿腺病毒肺炎", "雀斑", "细菌性肺炎", "尿道损伤", "前列腺肥大", "尺桡骨双骨折", "风疹", "三尖瓣下移畸形",
            "寻常狼疮", "颜面再发性皮炎", "急性乳腺炎", "踝部扭伤", "智力低下", "新生儿生理性黄疸",
            "特发性呼吸窘迫综合征", "心室间隔缺损", "结肠和直肠息肉", "盆底痉挛综合征", "婴幼儿支气管炎", "单纯疱疹",
            "维生素D缺乏性手足搐搦症", "脊柱侧凸", "脊柱骨折", "雷诺病", "食管憩室", "髌骨骨折", "玫瑰糠疹", "天疱疮",
            "肩关节脱位", "尖锐湿疣", "盆腔脓肿", "接触性皮炎", "植物-日光性皮炎", "肱骨外科颈骨折", "膝关节韧带损伤",
            "肠扭转", "新生儿鹅口疮", "新生儿脐炎", "滑囊炎", "反流性食管炎", "包茎和包皮过长", "骨盆骨折",
            "腰椎管狭窄症", "腹部损伤", "颌面部间隙感染", "急性腰扭伤", "手外伤", "黄褐斑", "毛发红糠疹", "厌食症",
            "股疝", "男性乳房肥大症", "膈疝", "贲门失弛缓症", "脐疝", "桡骨下端骨折", "下肢静脉曲张", "药物性皮炎",
            "血尿", "痒疹", "毛发苔藓", "营养性贫血", "肋软骨炎", "结节病", "传染性软疣", "急性化脓性睾丸炎",
            "直肠前突", "粟丘疹", "婴幼儿支气管哮喘", "静脉血栓形成和栓性静脉炎", "新生儿硬肿症", "男子不育症",
            "臂丛神经血管受压症", "银屑病(牛皮癣)", "尿布皮炎", "新生儿弥散性血管内凝血", "下肢淋巴水肿", "瘢痕疙瘩",
            "粟粒疹", "婴儿湿疹", "胫腓骨干骨折", "急性脓胸", "痔", "膝关节半月软骨损伤", "动脉粥样硬化症", "红皮病",
            "新生儿窒息", "肱骨干骨折", "新生儿化脓性脑膜炎", "动脉栓塞", "金葡菌性烫伤样皮肤综合征", "肾积水",
            "麻风病", "肺包囊虫病", "新生儿肺炎", "腹股沟直疝", "急性发热性中性粒细胞增多性皮肤病", "萎缩性硬化性苔藓",
            "新生儿淋病性结膜炎", "疥疮", "大骨节病", "类天疱疮", "股骨颈骨折", "鱼鳞病", "指骨骨折", "乳糜尿",
            "精索静脉曲张", "胸腺咽管(腮裂囊肿或瘘）", "支原体肺炎", "隐睾症", "梅毒", "酒渣鼻", "强直性脊柱炎", "脱发",
            "腰肌劳损"}

# 准备CSV输出
output_file_path = 'output_WM.csv'
header = ['疾病', '治疗方法']

# 打开CSV文件并写入数据
with open(output_file_path, 'w', encoding='utf-8', newline='') as csvfile:
    csv_writer = csv.writer(csvfile)
    csv_writer.writerow(header)  # 写入表头

    for disease in diseases:
        # 准备输入数据
        input_text = f"给出{disease}的西医治疗方法。"
        input_ids = tokenizer([input_text], return_tensors="pt", add_special_tokens=False).input_ids

        # 将输入数据移至GPU（如适用）
        if torch.cuda.is_available():
            input_ids = input_ids.to('cuda')

        # 配置生成参数
        generate_input = {
            "input_ids": input_ids,
            "max_new_tokens": 1024,
            "do_sample": True,
            "top_k": 50,
            "top_p": 0.95,
            "temperature": 0.3,
            "repetition_penalty": 1.3,
            "eos_token_id": tokenizer.eos_token_id,
            "bos_token_id": tokenizer.bos_token_id,
            "pad_token_id": tokenizer.pad_token_id
        }
        generate_ids = model.generate(**generate_input)
        text = tokenizer.decode(generate_ids[0], skip_special_tokens=True)

        # 将生成的文本写入CSV文件
        csv_writer.writerow([disease, text])

print(f"生成的文本已写入CSV文件: {output_file_path}")
